## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.aks.azurerm_kubernetes_cluster.prod will be updated in-place
  ~ resource "azurerm_kubernetes_cluster" "prod" {
        id                                  = "/subscriptions/286a69d3-dc09-45e3-b4a1-1b7dc9a02f90/resourceGroups/cst8918-final-project-group-2-rg/providers/Microsoft.ContainerService/managedClusters/cst8918-final-project-group-2-aks-prod"
        name                                = "cst8918-final-project-group-2-aks-prod"
        tags                                = {}
        # (31 unchanged attributes hidden)

      ~ default_node_pool {
            name                          = "prodnp"
            tags                          = {}
            # (30 unchanged attributes hidden)

          - upgrade_settings {
              - drain_timeout_in_minutes      = 0 -> null
              - max_surge                     = "10%" -> null
              - node_soak_duration_in_minutes = 0 -> null
            }
        }

        # (5 unchanged blocks hidden)
    }

  # module.aks.azurerm_kubernetes_cluster.test will be updated in-place
  ~ resource "azurerm_kubernetes_cluster" "test" {
        id                                  = "/subscriptions/286a69d3-dc09-45e3-b4a1-1b7dc9a02f90/resourceGroups/cst8918-final-project-group-2-rg/providers/Microsoft.ContainerService/managedClusters/cst8918-final-project-group-2-aks-test"
        name                                = "cst8918-final-project-group-2-aks-test"
        tags                                = {}
        # (31 unchanged attributes hidden)

      ~ default_node_pool {
            name                          = "testnp"
            tags                          = {}
            # (30 unchanged attributes hidden)

          - upgrade_settings {
              - drain_timeout_in_minutes      = 0 -> null
              - max_surge                     = "10%" -> null
              - node_soak_duration_in_minutes = 0 -> null
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.remix_weather_app.kubernetes_deployment.remix_weather_app_prod will be created
  + resource "kubernetes_deployment" "remix_weather_app_prod" {
      + id               = (known after apply)
      + wait_for_rollout = true

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app" = "remix-weather-app"
            }
          + name             = "remix-weather-app"
          + namespace        = "default"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + min_ready_seconds         = 0
          + paused                    = false
          + progress_deadline_seconds = 600
          + replicas                  = "1"
          + revision_history_limit    = 10

          + selector {
              + match_labels = {
                  + "app" = "remix-weather-app"
                }
            }

          + strategy (known after apply)

          + template {
              + metadata {
                  + generation       = (known after apply)
                  + labels           = {
                      + "app" = "remix-weather-app"
                    }
                  + name             = (known after apply)
                  + resource_version = (known after apply)
                  + uid              = (known after apply)
                }
              + spec {
                  + automount_service_account_token  = true
                  + dns_policy                       = "ClusterFirst"
                  + enable_service_links             = true
                  + host_ipc                         = false
                  + host_network                     = false
                  + host_pid                         = false
                  + hostname                         = (known after apply)
                  + node_name                        = (known after apply)
                  + restart_policy                   = "Always"
                  + scheduler_name                   = (known after apply)
                  + service_account_name             = (known after apply)
                  + share_process_namespace          = false
                  + termination_grace_period_seconds = 30

                  + container {
                      + image                      = "cst8918finalprojectgroup2acr.azurecr.io/remix-weather-app:latest"
                      + image_pull_policy          = (known after apply)
                      + name                       = "remix-weather-app"
                      + stdin                      = false
                      + stdin_once                 = false
                      + termination_message_path   = "/dev/termination-log"
                      + termination_message_policy = (known after apply)
                      + tty                        = false

                      + env {
                          + name = "WEATHER_API_KEY"

                          + value_from {
                              + secret_key_ref {
                                  + key  = "WEATHER_API_KEY"
                                  + name = "remix-weather-app-secrets"
                                }
                            }
                        }
                      + env {
                          + name = "REDIS_URL"

                          + value_from {
                              + secret_key_ref {
                                  + key  = "REDIS_URL"
                                  + name = "remix-weather-app-secrets"
                                }
                            }
                        }

                      + port {
                          + container_port = 80
                          + protocol       = "TCP"
                        }

                      + resources {
                          + limits   = {
                              + "cpu"    = "500m"
                              + "memory" = "256Mi"
                            }
                          + requests = {
                              + "cpu"    = "100m"
                              + "memory" = "128Mi"
                            }
                        }
                    }

                  + image_pull_secrets (known after apply)

                  + readiness_gate (known after apply)
                }
            }
        }
    }

Plan: 1 to add, 2 to change, 0 to destroy.
```
</details>